
## Plan Result

[CI link](https://github.com/higa-private/Azure/actions/runs/17771759392)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.key_vault_contributor
* Update
  * azurerm_linux_virtual_machine.vm
  * azurerm_storage_account.storage_account
* Delete
  * azurerm_role_assignment.vm_keyvault_secrets_reader
* Replace
  * azurerm_role_assignment.key_vault_secret_writer


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_virtual_machine.vm will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "vm" {
        id                                                     = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/resourceGroups/develop-rg/providers/Microsoft.Compute/virtualMachines/runner-vm"
        name                                                   = "runner-vm"
        tags                                                   = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_role_assignment.key_vault_contributor will be created
  + resource "azurerm_role_assignment" "key_vault_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "453e8174-7812-46e0-b798-f15eade05902"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/resourceGroups/develop-rg/providers/Microsoft.KeyVault/vaults/terraform20250909"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.key_vault_secret_writer must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_secret_writer" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/resourceGroups/develop-rg/providers/Microsoft.KeyVault/vaults/terraform20250909/providers/Microsoft.Authorization/roleAssignments/02485566-fb6e-5346-2df6-faf0697d3b0d" -> (known after apply)
      ~ name                             = "02485566-fb6e-5346-2df6-faf0697d3b0d" -> (known after apply)
      - principal_id                     = "6eb188d5-0a35-4520-95c3-48ca9f74037e" -> null # forces replacement
      ~ principal_type                   = "User" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> "/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" # forces replacement
      ~ role_definition_name             = "Key Vault Secrets Officer" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_role_assignment.vm_keyvault_secrets_reader will be destroyed
  # (because azurerm_role_assignment.vm_keyvault_secrets_reader is not in configuration)
  - resource "azurerm_role_assignment" "vm_keyvault_secrets_reader" {
      - id                   = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/resourceGroups/develop-rg/providers/Microsoft.KeyVault/vaults/terraform20250909/providers/Microsoft.Authorization/roleAssignments/4742c529-4391-aaaa-c5ab-d536edaf3c12" -> null
      - name                 = "4742c529-4391-aaaa-c5ab-d536edaf3c12" -> null
      - principal_id         = "453e8174-7812-46e0-b798-f15eade05902" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> null
      - role_definition_name = "Key Vault Secrets Officer" -> null
      - scope                = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/resourceGroups/develop-rg/providers/Microsoft.KeyVault/vaults/terraform20250909" -> null
    }

  # azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/resourceGroups/develop-rg/providers/Microsoft.Storage/storageAccounts/develop01"
        name                              = "develop01"
        tags                              = {}
        # (40 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"Terraform_Exec","PRNumber":2,"Program":"tfcmt","SHA1":"49ffc7f6b8185c4d4f440a7b23546e0438eaa809","Vars":{},"WorkflowName":"develop workflow test"} -->